In [1]:
# Import libraries
import pandas as pd
import re
import requests as req
from bs4 import BeautifulSoup as bs
import json
import warnings
warnings.simplefilter('ignore')
from sqlalchemy import create_engine

In [2]:
# Cleaning functions (py file) placed in src folder.
import sys
sys.path.append("../")
from src.cleaning import *

In [3]:
# Cleaning functions (py file) placed in src folder.
import sys
sys.path.append("../")
from src.scrapping import *

# Import data

In [4]:
# Import data
df=pd.read_csv("../data/Artworks.csv")

df.head(3)

,Title,Artist,ConstituentID,ArtistBio,Nationality,BeginDate,EndDate,Gender,Date,Medium,...,ThumbnailURL,Circumference (cm),Depth (cm),Diameter (cm),Height (cm),Length (cm),Weight (kg),Width (cm),Seat Height (cm),Duration (sec.)
0,"Ferdinandsbrücke Project, Vienna, Austria, Ele...",Otto Wagner,6210,"(Austrian, 1841–1918)",(Austrian),(1841),(1918),(Male),1896,Ink and cut-and-pasted painted pages on paper,...,http://www.moma.org/media/W1siZiIsIjU5NDA1Il0s...,NaN,NaN,NaN,48.6000,NaN,NaN,168.9000,NaN,NaN
1,"City of Music, National Superior Conservatory ...",Christian de Portzamparc,7470,"(French, born 1944)",(French),(1944),(0),(Male),1987,Paint and colored pencil on print,...,http://www.moma.org/media/W1siZiIsIjk3Il0sWyJw...,NaN,NaN,NaN,40.6401,NaN,NaN,29.8451,NaN,NaN
2,"Villa near Vienna Project, Outside Vienna, Aus...",Emil Hoppe,7605,"(Austrian, 1876–1957)",(Austrian),(1876),(1957),(Male),1903,"Graphite, pen, color pencil, ink, and gouache ...",...,http://www.moma.org/media/W1siZiIsIjk4Il0sWyJw...,NaN,NaN,NaN,34.3000,NaN,NaN,31.8000,NaN,NaN

# Data examination

In [5]:
artist = list(df.Artist.unique())

In [6]:
len(artist)

13863

In [7]:
df.shape

(132403, 29)

In [8]:
df.isnull().sum()

Title                     45
Artist                  1461
ConstituentID           1461
ArtistBio               4734
Nationality             1461
BeginDate               1461
EndDate                 1461
Gender                  1461
Date                    2166
Medium                 11225
Dimensions             11243
CreditLine              2924
AccessionNumber            0
Classification             0
Department                 0
DateAcquired            5994
Cataloged                  0
ObjectID                   0
URL                    57280
ThumbnailURL           68263
Circumference (cm)    132393
Depth (cm)            120479
Diameter (cm)         130985
Height (cm)            18765
Length (cm)           131665
Weight (kg)           132110
Width (cm)             19664
Seat Height (cm)      132403
Duration (sec.)       129258
dtype: int64

Trabajo con los artistas que han presentado trabajos en los últimos 50 años.

# CLEANING

Drop columns non useful

In [9]:
# DROP columns that are not useful for my analysis.
df1 = df.drop(["Title", "ConstituentID", "ArtistBio","Medium","ThumbnailURL", "BeginDate", "Gender", "EndDate", "Circumference (cm)", "Depth (cm)", "Diameter (cm)", "Height (cm)", "Length (cm)", "Weight (kg)", "Width (cm)", "Seat Height (cm)", "Duration (sec.)", "Dimensions", "CreditLine", "AccessionNumber", "Department", "DateAcquired", "Cataloged", "ObjectID", "URL"],axis=1)

In [10]:
df1.sample()

              Artist Nationality  Date    Classification
14849  Roberto Matta   (Chilean)  1947  Illustrated Book

Cleaning column date

In [11]:
# Cleaning "date" column to obtain an integer year.
date = list(df1.Date.unique())

In [12]:
date[:5]

['1896', '1987', '1903', '1980', '1976-77']

In [13]:
df1['year'] = df1['Date'].str.extract(r"(\d+)")

In [14]:
df1.head(3)

                     Artist Nationality  Date Classification  year
0               Otto Wagner  (Austrian)  1896   Architecture  1896
1  Christian de Portzamparc    (French)  1987   Architecture  1987
2                Emil Hoppe  (Austrian)  1903   Architecture  1903

In [15]:
# Dropping column "Date"; I am going to use "year" column.
df1 = df1.drop(["Date"],axis=1)

In [16]:
df1.sample()

                 Artist  Nationality Classification  year
61303  Jorge de la Vega  (Argentine)          Print  1967

In [17]:
# Drop rows that have NaN in year column.
df1 = df1[df1['year'].notna()]

In [18]:
"""def integrar(x):
        return int(x)"""

'def integrar(x):\n        return int(x)'

In [19]:
integrar

In [20]:
df1["year"] = df1.year.apply(integrar)

In [21]:
# I focus on the exhibitions from the last 50 years.
df2 = df1[df1["year"]>=1972]

In [22]:
df2.shape

(42319, 4)

In [23]:
# Elimino los NaN en la columna artist.
df2 = df2[df2['Artist'].notna()]

In [24]:
artist = list(df2.Artist)

In [25]:
artist[:5]

['Christian de Portzamparc',
 'Bernard Tschumi',
 'Bernard Tschumi',
 'Bernard Tschumi',
 'Bernard Tschumi']

Cleaning column Artist.

In [26]:
# I first make a split on ",", and after that I make an "explode".

"""def split(x):
    return x.split(",")"""
#df2['artist'] = df2['Artist'].str.split(",")

'def split(x):\n    return x.split(",")'

In [27]:
split

In [28]:
df2["artist"] = df2.Artist.apply(split)

In [29]:
art = list(df2.artist)

In [30]:
art[:5]

[['Christian de Portzamparc'],
 ['Bernard Tschumi'],
 ['Bernard Tschumi'],
 ['Bernard Tschumi'],
 ['Bernard Tschumi']]

Cleaning column Country

In [31]:
#LIMPIEZA columna country.
"""def split2(x):
    return x.split(" ")"""
# df2['Country'] = df2['Nationality'].str.split(" ")

'def split2(x):\n    return x.split(" ")'

In [32]:
split2

In [33]:
df2["Countries"] = df2.Nationality.apply(split2)

In [34]:
df3 = df2.explode('artist').explode('Countries')

In [35]:
"""def strip(x):
    return x.strip()"""

'def strip(x):\n    return x.strip()'

In [36]:
strip

In [37]:
df3["artist"] = df3.artist.apply(strip)

In [38]:
art = list((df3.artist).unique())

In [39]:
#At the end I obtain this list.
art[:5]

['Christian de Portzamparc',
 'Bernard Tschumi',
 'Peter Eisenman',
 'Robert Cole',
 'Rem Koolhaas']

In [40]:
df3 = df3.drop(["Artist"],axis=1)

In [41]:
df3.head(3)

  Nationality Classification  year                    artist Countries
1    (French)   Architecture  1987  Christian de Portzamparc  (French)
3          ()   Architecture  1980           Bernard Tschumi        ()
5          ()   Architecture  1976           Bernard Tschumi        ()

In [42]:
list_countries = list(df3.Countries)
list_countries[:5]

['(French)', '()', '()', '()', '()']

In [43]:
#Change Nationality for country.
#df3['country'] = df3['Country'].replace("(French)", "France").replace("(American)", "United States").replace("(Italian)", "Italy").replace("(Dutch)", "Netherlands").replace("(British)", "United Kingdom").replace("(Japanese)", "Japan").replace("(Argentine)", "Argentina").replace("(Swiss)", "Switzerland").replace("(Luxembourgish)", "Luxembourg").replace("(Spanish)", "Spain").replace("(Polish)", "Poland").replace("(Austrian)", "Austria").replace("(Iranian)", "Iran").replace("(German)", "Germany").replace("(Moroccan)", "Morocco").replace("(Danish)", "Denmark").replace("(Canadian)", "Canada").replace("(Brazilian)", "Brazil").replace("(Venezuelan)", "Venezuela").replace("(Belgian)", "Belgium").replace("(Norwegian)", "Norway").replace("(Finnish)", "Finland").replace("(Swedish)", "Sweden").replace("(Colombian)", "Colombia").replace("(Australian)", "Autralia").replace("(Yugoslav)", "Yugoslavia").replace("(Nationality", "None").replace("unknown)", "None").replace("(Hungarian)", "Hungary").replace("(Mexican)", "Mexico").replace("(Greek)", "Greece").replace("(Israeli)", "Israel").replace("(Croatian)", "Croatia").replace("(Cuban)", "Cuba").replace("(Thai)", "Thailand"). replace("(Czech)", "Czech Republic").replace("(Chilean)", "Chile").replace("(Various)", "None").replace("(Romanian)", "Romania").replace("(South", "South Africa").replace("African)", "South Africa").replace("(Russian)", "Russian Federation").replace("(Congolese)", "Central African Republic").replace("(Ukrainian)", "Ukraine").replace("(Peruvian)", "Peru").replace("(Indian)", "India").replace("(Cambodian)", "Cambodia").replace("(Haitian)", "Haiti").replace("(Scottish)", "United Kingdom").replace("(Korean)", "South Korea").replace("(Slovak)", "Slovak Republic").replace("(Estonian)", "Estonia").replace("(Pakistani)", "Pakistan").replace("(Icelandic)", "Iceland").replace("(Portuguese)", "Portugal").replace("(Chinese)", "China").replace("(Paraguayan)", "Paraguay").replace("(Uruguayan)", "Uruguay").replace("(Tunisian)", "Tunisia").replace("(Guyanese)", "Guatemala").replace("(Senegalese)", "Senegal").replace("(Bahamian)", "Cuba").replace("(Turkish)", "Turkey").replace("(Malian)", "Mali").replace("(Bulgarian)", "Bulgaria").replace("(New", "New Zealand").replace("Zealander)", "New Zealand").replace("(Irish)", "Ireland").replace("(Lebanese)", "Lebanon").replace("(English)", "United Kingdom"). replace("(Welsh)", "United Kingdom").replace("(Cypriot)", "Cyprus").replace("(Kenyan)", "Kenya").replace("(Syrian)", "Syrian Arab Republic").replace("(Saudi", "Saudi Arabia").replace("Arabian)", "Saudi Arabia").replace("(Slovenian)", "Slovenia").replace("(Nigerian)", "Central African Republic").replace("(Native", "United States").replace("American)", "United States").replace("(Bosnian)","Bosnia and Herzegovina").replace("Unknown)", "None").replace("(Kazakhstani)", "Kazakhstan").replace("(Kyrgyzstani)", "Kyrgyz Republic").replace("(Palestinian)", "Israel").replace("(Catalan)", "Spain").replace("(Vietnamese)", "Vietnam").replace("(Indonesian)", "Indonesia").replace("(Filipino)", "Philippines").replace("(Guatemalan)", "Guatemala").replace("(Egyptian)", "Egypt").replace("(Ghanaian)", "Ghana").replace("(Serbian)", "Bosnia and Herzegovina").replace("(Mauritanian)", "Mauritania").replace("(Ugandan)", "Uganda").replace("(Taiwanese)", "Taiwan").replace("(Albanian)", "Albania").replace("(Malaysian)", "Malaysia").replace("(Iraqi)", "Iraq").replace("()", "None").replace("(Tajik)", "Tajikistan").replace("(Singaporean)", "Singapore").replace("(Puerto", "Dominican Republic").replace("Rican)","Dominican Republic").replace("(Zimbabwean)", "Zimbabwe").replace("(Cameroonian)", "Cameroon").replace("(Rwandan)", "Rwanda").replace("(Mozambican)", "Mozambique").replace("(Macedonian)", "Greece").replace("(Georgian)", "None").replace("(Sudanese)", "Sudan")

In [44]:
"""def replace(x):
    return x.replace("(French)", "France").replace("(American)", "United States").replace("(Italian)", "Italy")
    .replace("(Dutch)", "Netherlands").replace("(British)", "United Kingdom").replace("(Japanese)", "Japan")
    .replace("(Argentine)", "Argentina").replace("(Swiss)", "Switzerland").replace("(Luxembourgish)", "Luxembourg")
    .replace("(Spanish)", "Spain").replace("(Polish)", "Poland").replace("(Austrian)", "Austria").replace("(Iranian)", "Iran")
    .replace("(German)", "Germany").replace("(Moroccan)", "Morocco").replace("(Danish)", "Denmark").
    replace("(Canadian)", "Canada").replace("(Brazilian)", "Brazil").replace("(Venezuelan)", "Venezuela")
    .replace("(Belgian)", "Belgium").replace("(Norwegian)", "Norway").replace("(Finnish)", "Finland")
    .replace("(Swedish)", "Sweden").replace("(Colombian)", "Colombia").replace("(Australian)", "Autralia")
    .replace("(Yugoslav)", "Yugoslavia").replace("(Nationality", "None").replace("unknown)", "None")
    .replace("(Hungarian)", "Hungary").replace("(Mexican)", "Mexico").replace("(Greek)", "Greece")
    .replace("(Israeli)", "Israel").replace("(Croatian)", "Croatia").replace("(Cuban)", "Cuba")
    .replace("(Thai)", "Thailand"). replace("(Czech)", "Czech Republic").replace("(Chilean)", "Chile")
    .replace("(Various)", "None").replace("(Romanian)", "Romania").replace("(South", "South Africa")
    .replace("African)", "South Africa").replace("(Russian)", "Russian Federation")
    .replace("(Congolese)", "Central African Republic").replace("(Ukrainian)", "Ukraine").replace("(Peruvian)", "Peru")
    .replace("(Indian)", "India").replace("(Cambodian)", "Cambodia").replace("(Haitian)", "Haiti")
    .replace("(Scottish)", "United Kingdom").replace("(Korean)", "South Korea").replace("(Slovak)", "Slovak Republic")
    .replace("(Estonian)", "Estonia").replace("(Pakistani)", "Pakistan").replace("(Icelandic)", "Iceland")
    .replace("(Portuguese)", "Portugal").replace("(Chinese)", "China").replace("(Paraguayan)", "Paraguay")
    .replace("(Uruguayan)", "Uruguay").replace("(Tunisian)", "Tunisia").replace("(Guyanese)", "Guatemala")
    .replace("(Senegalese)", "Senegal").replace("(Bahamian)", "Cuba").replace("(Turkish)", "Turkey")
    .replace("(Malian)", "Mali").replace("(Bulgarian)", "Bulgaria").replace("(New", "New Zealand")
    .replace("Zealander)", "New Zealand").replace("(Irish)", "Ireland").replace("(Lebanese)", "Lebanon")
    .replace("(English)", "United Kingdom"). replace("(Welsh)", "United Kingdom").replace("(Cypriot)", "Cyprus")
    .replace("(Kenyan)", "Kenya").replace("(Syrian)", "Syrian Arab Republic").replace("(Saudi", "Saudi Arabia")
    .replace("Arabian)", "Saudi Arabia").replace("(Slovenian)", "Slovenia").replace("(Nigerian)", "Central African Republic")
    .replace("(Native", "United States").replace("American)", "United States").replace("(Bosnian)","Bosnia and Herzegovina")
    .replace("Unknown)", "None").replace("(Kazakhstani)", "Kazakhstan").replace("(Kyrgyzstani)", "Kyrgyz Republic")
    .replace("(Palestinian)", "Israel").replace("(Catalan)", "Spain").replace("(Vietnamese)", "Vietnam")
    .replace("(Indonesian)", "Indonesia").replace("(Filipino)", "Philippines").replace("(Guatemalan)", "Guatemala")
    .replace("(Egyptian)", "Egypt").replace("(Ghanaian)", "Ghana").replace("(Serbian)", "Bosnia and Herzegovina")
    .replace("(Mauritanian)", "Mauritania").replace("(Ugandan)", "Uganda").replace("(Taiwanese)", "Taiwan")
    .replace("(Albanian)", "Albania").replace("(Malaysian)", "Malaysia").replace("(Iraqi)", "Iraq").replace("()", "None")
    .replace("(Tajik)", "Tajikistan").replace("(Singaporean)", "Singapore").replace("(Puerto", "Dominican Republic")
    .replace("Rican)","Dominican Republic").replace("(Zimbabwean)", "Zimbabwe").replace("(Cameroonian)", "Cameroon")
    .replace("(Rwandan)", "Rwanda").replace("(Mozambican)", "Mozambique").replace("(Macedonian)", "Greece")
    .replace("(Georgian)", "None").replace("(Sudanese)", "Sudan")"""

'def replace(x):\n    return x.replace("(French)", "France").replace("(American)", "United States").replace("(Italian)", "Italy")\n    .replace("(Dutch)", "Netherlands").replace("(British)", "United Kingdom").replace("(Japanese)", "Japan")\n    .replace("(Argentine)", "Argentina").replace("(Swiss)", "Switzerland").replace("(Luxembourgish)", "Luxembourg")\n    .replace("(Spanish)", "Spain").replace("(Polish)", "Poland").replace("(Austrian)", "Austria").replace("(Iranian)", "Iran")\n    .replace("(German)", "Germany").replace("(Moroccan)", "Morocco").replace("(Danish)", "Denmark").\n    replace("(Canadian)", "Canada").replace("(Brazilian)", "Brazil").replace("(Venezuelan)", "Venezuela")\n    .replace("(Belgian)", "Belgium").replace("(Norwegian)", "Norway").replace("(Finnish)", "Finland")\n    .replace("(Swedish)", "Sweden").replace("(Colombian)", "Colombia").replace("(Australian)", "Autralia")\n    .replace("(Yugoslav)", "Yugoslavia").replace("(Nationality", "None").replace("unknown)", "None")\n    .replace("(Hungarian)", "Hungary").replace("(Mexican)", "Mexico").replace("(Greek)", "Greece")\n    .replace("(Israeli)", "Israel").replace("(Croatian)", "Croatia").replace("(Cuban)", "Cuba")\n    .replace("(Thai)", "Thailand"). replace("(Czech)", "Czech Republic").replace("(Chilean)", "Chile")\n    .replace("(Various)", "None").replace("(Romanian)", "Romania").replace("(South", "South Africa")\n    .replace("African)", "South Africa").replace("(Russian)", "Russian Federation")\n    .replace("(Congolese)", "Central African Republic").replace("(Ukrainian)", "Ukraine").replace("(Peruvian)", "Peru")\n    .replace("(Indian)", "India").replace("(Cambodian)", "Cambodia").replace("(Haitian)", "Haiti")\n    .replace("(Scottish)", "United Kingdom").replace("(Korean)", "South Korea").replace("(Slovak)", "Slovak Republic")\n    .replace("(Estonian)", "Estonia").replace("(Pakistani)", "Pakistan").replace("(Icelandic)", "Iceland")\n    .replace("(Portuguese)", "Portugal").replace("(Chinese)", "China").replace("(Paraguayan)", "Paraguay")\n    .replace("(Uruguayan)", "Uruguay").replace("(Tunisian)", "Tunisia").replace("(Guyanese)", "Guatemala")\n    .replace("(Senegalese)", "Senegal").replace("(Bahamian)", "Cuba").replace("(Turkish)", "Turkey")\n    .replace("(Malian)", "Mali").replace("(Bulgarian)", "Bulgaria").replace("(New", "New Zealand")\n    .replace("Zealander)", "New Zealand").replace("(Irish)", "Ireland").replace("(Lebanese)", "Lebanon")\n    .replace("(English)", "United Kingdom"). replace("(Welsh)", "United Kingdom").replace("(Cypriot)", "Cyprus")\n    .replace("(Kenyan)", "Kenya").replace("(Syrian)", "Syrian Arab Republic").replace("(Saudi", "Saudi Arabia")\n    .replace("Arabian)", "Saudi Arabia").replace("(Slovenian)", "Slovenia").replace("(Nigerian)", "Central African Republic")\n    .replace("(Native", "United States").replace("American)", "United States").replace("(Bosnian)","Bosnia and Herzegovina")\n    .replace("Unknown)", "None").replace("(Kazakhstani)", "Kazakhstan").replace("(Kyrgyzstani)", "Kyrgyz Republic")\n    .replace("(Palestinian)", "Israel").replace("(Catalan)", "Spain").replace("(Vietnamese)", "Vietnam")\n    .replace("(Indonesian)", "Indonesia").replace("(Filipino)", "Philippines").replace("(Guatemalan)", "Guatemala")\n    .replace("(Egyptian)", "Egypt").replace("(Ghanaian)", "Ghana").replace("(Serbian)", "Bosnia and Herzegovina")\n    .replace("(Mauritanian)", "Mauritania").replace("(Ugandan)", "Uganda").replace("(Taiwanese)", "Taiwan")\n    .replace("(Albanian)", "Albania").replace("(Malaysian)", "Malaysia").replace("(Iraqi)", "Iraq").replace("()", "None")\n    .replace("(Tajik)", "Tajikistan").replace("(Singaporean)", "Singapore").replace("(Puerto", "Dominican Republic")\n    .replace("Rican)","Dominican Republic").replace("(Zimbabwean)", "Zimbabwe").replace("(Cameroonian)", "Cameroon")\n    .replace("(Rwandan)", "Rwanda").replace("(Mozambican)", "Mozambique").replace("(Macedonian)", "Greece")\n    .replace("(Georgian)", "None").replace("(Sudanese)", "Sudan")'

In [45]:
replace

In [46]:
df3["country"] = df3.Countries.apply(replace)

In [47]:
list_country = list((df3['country']).unique())

In [48]:
list_country[:5]

['France', 'None', 'United States', 'Netherlands', 'Italy']

In [49]:
df3 = df3.drop(["Countries"],axis=1)

In [50]:
df3 = df3.drop(["Nationality"],axis=1)

In [51]:
df3

          Classification  year                     artist        country
1           Architecture  1987   Christian de Portzamparc         France
3           Architecture  1980            Bernard Tschumi           None
5           Architecture  1976            Bernard Tschumi           None
6           Architecture  1976            Bernard Tschumi           None
7           Architecture  1976            Bernard Tschumi           None
...                  ...   ...                        ...            ...
132308             Print  2016  Christian Vinck Henriquez      Venezuela
132309          Multiple  2016  Christian Vinck Henriquez      Venezuela
132331  Illustrated Book  2015                Laura Owens  United States
132332  Illustrated Book  2015                Laura Owens  United States
132399             Video  2017               Martine Syms  United States

[82856 rows x 4 columns]

In [52]:
df3.drop(df3.loc[df3['country']=='None'].index, inplace=True)

In [53]:
df4= df3.drop_duplicates()

In [54]:
df4

          Classification  year                     artist        country
1           Architecture  1987   Christian de Portzamparc         France
66          Architecture  1987               Rem Koolhaas    Netherlands
66          Architecture  1987        Madelon Vriesendorp    Netherlands
67          Architecture  1979             Roger C. Ferri  United States
72          Architecture  1978             Michael Graves  United States
...                  ...   ...                        ...            ...
132284          Multiple  2016              Nicolás Paris       Colombia
132288  Illustrated Book  2016              Nicolás Paris       Colombia
132289             Print  2016            Rosângela Rennó         Brazil
132290             Print  2016  Christian Vinck Henriquez      Venezuela
132291          Multiple  2016  Christian Vinck Henriquez      Venezuela

[17242 rows x 4 columns]

In [55]:
df4.reset_index()

,index,Classification,year,artist,country
0,1,Architecture,1987,Christian de Portzamparc,France
1,66,Architecture,1987,Rem Koolhaas,Netherlands
2,66,Architecture,1987,Madelon Vriesendorp,Netherlands
3,67,Architecture,1979,Roger C. Ferri,United States
4,72,Architecture,1978,Michael Graves,United States
...,...,...,...,...,...
17237,132284,Multiple,2016,Nicolás Paris,Colombia
17238,132288,Illustrated Book,2016,Nicolás Paris,Colombia
17239,132289,Print,2016,Rosângela Rennó,Brazil
17240,132290,Print,2016,Christian Vinck Henriquez,Venezuela
17241,132291,Multiple,2016,Christian Vinck Henriquez,Venezuela

In [56]:
df4.to_csv("moma.csv", index = False)

# Enrich data base with scraping

EDUCATIONAL DATA (Creativity index)

In [57]:
url = 'http://chartsbin.com/view/41109'

In [58]:
html=req.get(url).content

In [59]:
soup=bs(html, 'html.parser')
type(soup)

bs4.BeautifulSoup

In [60]:
tabla=soup.find('table')

type(tabla)

bs4.element.Tag

In [61]:
filas=tabla.find_all('tr')

elementos=[[e.text for e in fila] for fila in filas]
elementos[:5]

[['Rank',
  'Country',
  'Technology',
  'Talent',
  'Tolerance',
  'Global Creativity Index'],
 ['1', 'Australia', '7', '1', '4', '0.97'],
 ['2', 'United States', '4', '3', '11', '0.95'],
 ['3', 'New Zealand', '7', '8', '3', '0.949'],
 ['4', 'Canada', '13', '14', '1', '0.92']]

In [62]:
"""def arrange_table(x):
    return [[e.text for e in fila] for fila in x]"""

'def arrange_table(x):\n    return [[e.text for e in fila] for fila in x]'

In [63]:
arrange_table

In [64]:
# elementos = filas.apply(arrange_table)
elementos[:5]

[['Rank',
  'Country',
  'Technology',
  'Talent',
  'Tolerance',
  'Global Creativity Index'],
 ['1', 'Australia', '7', '1', '4', '0.97'],
 ['2', 'United States', '4', '3', '11', '0.95'],
 ['3', 'New Zealand', '7', '8', '3', '0.949'],
 ['4', 'Canada', '13', '14', '1', '0.92']]

In [67]:
col_names=elementos[0]

data=elementos[1:]

education=pd.DataFrame(data, columns=['Rank', 'Country', 'Technology', 'Talent', 'Tolerance',
       'Global_Creativity_Index'])

education.head(5)

  Rank        Country Technology Talent Tolerance Global_Creativity_Index
0    1      Australia          7      1         4                    0.97
1    2  United States          4      3        11                    0.95
2    3    New Zealand          7      8         3                   0.949
3    4         Canada         13     14         1                    0.92
4    5        Denmark         10      6        13                   0.917

In [ ]:
education.to_csv("education.csv", index = False)

ECONOMY (GDP)

I find the GDP of 4 years distributed on the last 50 years to make the avareage and obtain a value closer to the reality of these years. I have chosen these years; 1980, 1999, 2010 and 2020.

Año 1980

In [68]:
url = 'https://countryeconomy.com/gdp?year=1980'

In [69]:
html=req.get(url).content

In [70]:
soup=bs(html, 'html.parser')
type(soup)

bs4.BeautifulSoup

In [71]:
tabla=soup.find('table')

type(tabla)

bs4.element.Tag

In [73]:
filas=tabla.find_all('tr')

elementos=[[e.text.replace("\xa0M€", "").replace("\xa0M$", "").replace("[+]", "").strip() for e in fila] for fila in filas]

elementos[:5]

[['Countries', 'Date', 'Annual GDP', 'Annual GDP', 'GDP Growth (%)'],
 ['United States', '1980', '', '', '$2,857,300M', '', '-0.3%', ''],
 ['Euro zone', '1980', '', '', '$2,962,181M', '', '', ''],
 ['United Kingdom', '1980', '€406,184M', '', '$603,983M', '', '-2.0%', ''],
 ['Germany', '1980', '€610,968M', '', '$853,705M', '', '1.4%', '']]

In [74]:
gdp_80=[]


for e in elementos:
    tmp=[]

    for st in e:
        if st!='':
            tmp.append(st)
    gdp_80.append(tmp)
    
gdp_80[:5]

[['Countries', 'Date', 'Annual GDP', 'Annual GDP', 'GDP Growth (%)'],
 ['United States', '1980', '$2,857,300M', '-0.3%'],
 ['Euro zone', '1980', '$2,962,181M'],
 ['United Kingdom', '1980', '€406,184M', '$603,983M', '-2.0%'],
 ['Germany', '1980', '€610,968M', '$853,705M', '1.4%']]

In [75]:
columnas = ['Country', 'Date', 'AnnualGDP', 'AnnualGDP', 'GDP _Growth_percentage']

In [76]:
col_names=gdp_80[0]

data=gdp_80[1:]

df_80=pd.DataFrame(data, columns=columnas)

df_80.head(10)

          Country  Date    AnnualGDP    AnnualGDP GDP _Growth_percentage
0   United States  1980  $2,857,300M        -0.3%                   None
1       Euro zone  1980  $2,962,181M         None                   None
2  United Kingdom  1980    €406,184M    $603,983M                  -2.0%
3         Germany  1980    €610,968M    $853,705M                   1.4%
4          France  1980    €504,931M    $701,305M                   1.6%
5           Japan  1980    €770,809M  $1,127,880M                   2.8%
6           Spain  1980    €159,100M    $230,759M                   1.2%
7           Italy  1980    €331,149M    $482,019M                  19.6%
8        Portugal  1980      €8,236M     $32,607M                   4.6%
9          Greece  1980      €7,110M     $56,529M                   0.7%

Año 1999

In [77]:
url = 'https://countryeconomy.com/gdp?year=1999'

In [78]:
html=req.get(url).content

In [79]:
soup=bs(html, 'html.parser')
type(soup)

bs4.BeautifulSoup

In [80]:
tabla=soup.find('table')

type(tabla)

bs4.element.Tag

In [82]:
filas=tabla.find_all('tr')

elementos=[[e.text.replace("\xa0M€", "").replace("\xa0M$", "").replace("[+]", "").strip() for e in fila] for fila in filas]

elementos[:5]

[['Countries', 'Date', 'Annual GDP', 'Annual GDP', 'GDP Growth (%)'],
 ['United States', '1999', '€9,036,592M', '', '$9,631,200M', '', '4.8%', ''],
 ['Euro zone', '1999', '€6,456,826M', '', '$7,113,797M', '', '2.9%', ''],
 ['United Kingdom', '1999', '€1,578,395M', '', '$1,682,590M', '', '3.3%', ''],
 ['Germany', '1999', '€2,059,480M', '', '$2,197,130M', '', '1.9%', '']]

In [83]:
gdp_99=[]


for e in elementos:
    tmp=[]

    for st in e:
        if st!='':
            tmp.append(st)
    gdp_99.append(tmp)
    
gdp_99[:5]

[['Countries', 'Date', 'Annual GDP', 'Annual GDP', 'GDP Growth (%)'],
 ['United States', '1999', '€9,036,592M', '$9,631,200M', '4.8%'],
 ['Euro zone', '1999', '€6,456,826M', '$7,113,797M', '2.9%'],
 ['United Kingdom', '1999', '€1,578,395M', '$1,682,590M', '3.3%'],
 ['Germany', '1999', '€2,059,480M', '$2,197,130M', '1.9%']]

In [85]:
col_names=gdp_99[0]

data=gdp_99[1:]

df_99=pd.DataFrame(data, columns=columnas)

df_99.head(5)

          Country  Date    AnnualGDP    AnnualGDP GDP _Growth_percentage
0   United States  1999  €9,036,592M  $9,631,200M                   4.8%
1       Euro zone  1999  €6,456,826M  $7,113,797M                   2.9%
2  United Kingdom  1999  €1,578,395M  $1,682,590M                   3.3%
3         Germany  1999  €2,059,480M  $2,197,130M                   1.9%
4          France  1999  €1,400,999M  $1,492,670M                   3.4%

Año 2010

In [86]:
url = 'https://countryeconomy.com/gdp?year=2010'

In [87]:
html=req.get(url).content

In [88]:
soup=bs(html, 'html.parser')
type(soup)

bs4.BeautifulSoup

In [89]:
tabla=soup.find('table')

type(tabla)

bs4.element.Tag

In [90]:
filas=tabla.find_all('tr')

elementos=[[e.text.replace("\xa0M€", "").replace("\xa0M$", "").replace("[+]", "").strip() for e in fila] for fila in filas]

elementos[:5]

[['Countries', 'Date', 'Annual GDP', 'Annual GDP', 'GDP Growth (%)'],
 ['United States', '2010', '€11,351,739M', '', '$15,049,000M', '', '2.7%', ''],
 ['Euro zone', '2010', '€9,472,472M', '', '$12,629,070M', '', '2.2%', ''],
 ['United Kingdom', '2010', '€1,872,176M', '', '$2,484,020M', '', '2.1%', ''],
 ['Germany', '2010', '€2,564,400M', '', '$3,402,440M', '', '4.2%', '']]

In [91]:
gdp_10=[]


for e in elementos:
    tmp=[]

    for st in e:
        if st!='':
            tmp.append(st)
    gdp_10.append(tmp)
    
gdp_10[:5]

[['Countries', 'Date', 'Annual GDP', 'Annual GDP', 'GDP Growth (%)'],
 ['United States', '2010', '€11,351,739M', '$15,049,000M', '2.7%'],
 ['Euro zone', '2010', '€9,472,472M', '$12,629,070M', '2.2%'],
 ['United Kingdom', '2010', '€1,872,176M', '$2,484,020M', '2.1%'],
 ['Germany', '2010', '€2,564,400M', '$3,402,440M', '4.2%']]

In [92]:
col_names=gdp_10[0]

data=gdp_10[1:]

df_10=pd.DataFrame(data, columns=columnas)

df_10.head(3)

          Country  Date     AnnualGDP     AnnualGDP GDP _Growth_percentage
0   United States  2010  €11,351,739M  $15,049,000M                   2.7%
1       Euro zone  2010   €9,472,472M  $12,629,070M                   2.2%
2  United Kingdom  2010   €1,872,176M   $2,484,020M                   2.1%

Año 2020

In [93]:
url='https://countryeconomy.com/gdp?year=2020'

In [94]:
html=req.get(url).content

In [95]:
soup=bs(html, 'html.parser')
type(soup)

bs4.BeautifulSoup

In [96]:
tabla=soup.find('table')

type(tabla)

bs4.element.Tag

In [97]:
filas=tabla.find_all('tr')

elementos=[[e.text.replace("\xa0M€", "").replace("\xa0M$", "").replace("[+]", "").strip() for e in fila] for fila in filas]

elementos[5]

['France', '2020', '€2,302,860M', '', '$2,624,420M', '', '-7.9%', '']

In [98]:
gdp_20=[]


for e in elementos:
    tmp=[]

    for st in e:
        if st!='':
            tmp.append(st)
    gdp_20.append(tmp)
    
gdp_20[:5]

[['Countries', 'Date', 'Annual GDP', 'Annual GDP', 'GDP Growth (%)'],
 ['United States', '2020', '€18,292,506M', '$20,893,700M', '-3.4%'],
 ['Euro zone', '2020', '€11,400,271M', '$13,021,206M', '-6.4%'],
 ['United Kingdom', '2020', '€2,423,371M', '$2,709,680M', '-9.7%'],
 ['Germany', '2020', '€3,367,560M', '$3,843,340M', '-4.6%']]

In [99]:
col_names=gdp_20[0]

data=gdp_20[1:]

df_20=pd.DataFrame(data, columns=columnas)

df_20.head(3)

          Country  Date     AnnualGDP     AnnualGDP GDP _Growth_percentage
0   United States  2020  €18,292,506M  $20,893,700M                  -3.4%
1       Euro zone  2020  €11,400,271M  $13,021,206M                  -6.4%
2  United Kingdom  2020   €2,423,371M   $2,709,680M                  -9.7%

# MySQL

In [100]:
a= open("../Password.txt","r").read()

In [101]:
str_conn=f"mysql+pymysql://root:{a}@localhost:3306"

motor=create_engine(str_conn)  # motor de conexion

In [102]:
motor.execute('create database moma;')

In [103]:
str_conn=f"mysql+pymysql://root:{a}@localhost:3306/Moma"

motor=create_engine(str_conn)

Create a "data base" called "moma" in MySQL

In [105]:
data=pd.read_csv('moma.csv')
data.head(3)

  Classification  year                    artist      country
0   Architecture  1987  Christian de Portzamparc       France
1   Architecture  1987              Rem Koolhaas  Netherlands
2   Architecture  1987       Madelon Vriesendorp  Netherlands

To submit data from table "Artists" to MySQL.

In [106]:
data.to_sql(name='Artists', con=motor, if_exists='append', index=False)

In [107]:
pd.read_sql('select * from Artists', motor).head(3)

  Classification  year                    artist      country
0   Architecture  1987  Christian de Portzamparc       France
1   Architecture  1987              Rem Koolhaas  Netherlands
2   Architecture  1987       Madelon Vriesendorp  Netherlands

To submit data from table "Education" to MySQL.

In [108]:
education.to_sql(name='Education', con=motor, if_exists='append', index=False)

In [109]:
pd.read_sql('select * from Education', motor).head(3)

  Rank        Country Technology Talent Tolerance Global_Creativity_Index
0    1      Australia          7      1         4                    0.97
1    2  United States          4      3        11                    0.95
2    3    New Zealand          7      8         3                   0.949

To submit data from table "GDP" to MySQL. In this case I have 4 tables GDP from 1980, 1999, 2010 and 2020.

In [118]:
df_80.to_sql(name='GDP_80', con=motor, if_exists='append', index=False)

In [119]:
pd.read_sql('select * from GDP_80', motor).head()

          Country  Date  AnnualGDP GDP _Growth_percentage
0   United States  1980      -0.3%                   None
1       Euro zone  1980       None                   None
2  United Kingdom  1980  $603,983M                  -2.0%
3         Germany  1980  $853,705M                   1.4%
4          France  1980  $701,305M                   1.6%

In [120]:
df_99.to_sql(name='GDP_99', con=motor, if_exists='append', index=False)

In [121]:
pd.read_sql('select * from GDP_99', motor).head()

          Country  Date    AnnualGDP GDP _Growth_percentage
0   United States  1999  $9,631,200M                   4.8%
1       Euro zone  1999  $7,113,797M                   2.9%
2  United Kingdom  1999  $1,682,590M                   3.3%
3         Germany  1999  $2,197,130M                   1.9%
4          France  1999  $1,492,670M                   3.4%

In [122]:
df_10.to_sql(name='GDP_10', con=motor, if_exists='append', index=False)

In [123]:
pd.read_sql('select * from GDP_10', motor).head()

          Country  Date     AnnualGDP GDP _Growth_percentage
0   United States  2010  $15,049,000M                   2.7%
1       Euro zone  2010  $12,629,070M                   2.2%
2  United Kingdom  2010   $2,484,020M                   2.1%
3         Germany  2010   $3,402,440M                   4.2%
4          France  2010   $2,642,440M                   1.9%

In [124]:
df_20.to_sql(name='GDP_20', con=motor, if_exists='append', index=False)

In [125]:
pd.read_sql('select * from GDP_20', motor).head()

          Country  Date     AnnualGDP GDP _Growth_percentage
0   United States  2020  $20,893,700M                  -3.4%
1       Euro zone  2020  $13,021,206M                  -6.4%
2  United Kingdom  2020   $2,709,680M                  -9.7%
3         Germany  2020   $3,843,340M                  -4.6%
4          France  2020   $2,624,420M                  -7.9%

In [126]:
query=pd.read_sql('''
                    select Artists.Classification, Artists.year, Artists.artist, Education.Country, Education.Rank, Education.Global_Creativity_Index, GDP.AnnualGDP
                    from Artists
                    left join Education
                    on Artists.country=Education.Country
                    left join GDP
                    on GDP.Country=Education.Country
                    group by Education.Country;
                    ''',
                motor)

In [127]:
query

,Classification,year,artist,Country,Rank,Global_Creativity_Index,AnnualGDP
0,Architecture,1987,Christian de Portzamparc,France,16,0.822,"$701,305M"
1,Architecture,1987,Rem Koolhaas,Netherlands,10,0.889,"$193,758M"
2,Architecture,1979,Roger C. Ferri,United States,2,0.95,-0.3%
3,Architecture,1974,Aldo Rossi,Italy,21,0.715,"$482,019M"
4,Architecture,1979,Peter Cook,United Kingdom,12,0.881,"$603,983M"
...,...,...,...,...,...,...,...
81,Video,2006,Garin Nugroho,Indonesia,115,0.202,9.9%
82,Video,2007,Nan Achnas,Singapore,9,0.896,10.1%
83,Video,2006,Jeffrey Jeturian,Philippines,52,0.487,5.1%
84,Film,2006,João Luis Sol de Carvalho,Mozambique,90,0.346,4.2%
85,Design,1972,Velazquez Ribero,Dominican Republic,78,0.38,8.0%